Revit 2024 API
PhaseArray.ReverseIterator Method
Retrieve a backward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual PhaseArrayIterator ReverseIterator()
Visual Basic
Public Overridable Function ReverseIterator As PhaseArrayIterator
Visual C++
public:
virtual PhaseArrayIterator^ ReverseIterator()
Return Value
Returns a backward moving iterator to the array.
See Also
PhaseArray Class
Autodesk.Revit.DB Namespace